m = int(input("Вв номер места: "))

K = 4  # Мест в одном купе

coupe = (m - 1) // K + 1
print(f"Номер купе: {coupe}")


# 1  2  3  4    1
# 5  6  7  8    2
# 9 10 11 12    3
# .  .  .  .
#
# 0  1  2  3    0
# 4  5  6  7    1
# 8  9 10 11    2
# .  .  .  .

#   0   1   2   3   4      K = 5 (кол-во столбцов, ширина)
# +---+---+---+---+---+
# | 0 | 1 | 2 | 3 | 4 |   0
# +---+---+---+---+---+        Для 7-ки:
# | 5 | 6 | 7 | 8 | 9 |   1    x = 7 % K   (номер столбца)
# +---+---+---+---+---+        y = 7 // K   (номер строки)
# | 10| 11| 12| 13| 14|   2
# +---+---+---+---+---+        n = x + y*K
#                              где 0 <= x < K


